In [1]:
import pandas as pd

In [2]:
data1 = {
  'A': [1, 2, None, 4, 5],
  'B': [10, None, 30, 40, 50]
}

df = pd.DataFrame(data1)

In [3]:
df

     A     B
0  1.0  10.0
1  2.0   NaN
2  NaN  30.0
3  4.0  40.0
4  5.0  50.0

In [ ]:
# NaN - Not a Number (não é um número válido)

In [4]:
# Preencher valores ausentes com a média de cada coluna

df.fillna(df.mean(), inplace=True) # NaN
df

     A     B
0  1.0  10.0
1  2.0  32.5
2  3.0  30.0
3  4.0  40.0
4  5.0  50.0

In [5]:
data2 = {
  'A': [1, 2, None, 4, 5],
  'B': [10, None, 30, 40, 50]
}

df = pd.DataFrame(data2)
df

     A     B
0  1.0  10.0
1  2.0   NaN
2  NaN  30.0
3  4.0  40.0
4  5.0  50.0

In [6]:
# Remover linhas com pelo menos um valor ausente

# inplace=True - Se True, ele vai modificar o DataFrame diretamente e não retornar uma cópia
df.dropna(inplace=True)
df

     A     B
0  1.0  10.0
3  4.0  40.0
4  5.0  50.0

In [7]:
data3 = {
  'A': [1, 2, None, 4, 5],
  'B': [10, None, 30, 40, 50]
}

df = pd.DataFrame(data3)
df

     A     B
0  1.0  10.0
1  2.0   NaN
2  NaN  30.0
3  4.0  40.0
4  5.0  50.0

In [8]:
# Preencher os valores ausentes com um valor específico (por exemplo, -1)

df.fillna(-1, inplace=True)
df

     A     B
0  1.0  10.0
1  2.0  -1.0
2 -1.0  30.0
3  4.0  40.0
4  5.0  50.0

In [17]:
data4 = {
  'A': [1, 2, None, 4, 5],
  'B': [10, None, 30, 40, 50]
}

df = pd.DataFrame(data4)
df2 = pd.DataFrame(data4)
df

     A     B
0  1.0  10.0
1  2.0   NaN
2  NaN  30.0
3  4.0  40.0
4  5.0  50.0

In [18]:
# O método isna() acha os valores NaN e com os métodos de soma, se consegue ter o somatório por coluna ou o somatório geral

totalNaN = df2.isna().sum().sum()
totalNaN

2

In [20]:
totalNaNColuna = df.isna().sum()
totalNaNColuna

A    1
B    1
dtype: int64

In [21]:
data5 = {
  'A': [1, 2, None, 4, 5],
  'B': [10, None, 30, 40, 50]
}

df = pd.DataFrame(data5)
df

     A     B
0  1.0  10.0
1  2.0   NaN
2  NaN  30.0
3  4.0  40.0
4  5.0  50.0

In [22]:
# Para modificar os valores ausentes somente em uma coluna
df['B'].fillna(-1, inplace=True)
df

     A     B
0  1.0  10.0
1  2.0  -1.0
2  NaN  30.0
3  4.0  40.0
4  5.0  50.0

In [23]:
data6 = {
  'A': [1, 2, None, 4, 5],
  'B': [10, None, 30, 40, 50]
}

df = pd.DataFrame(data6)
df

     A     B
0  1.0  10.0
1  2.0   NaN
2  NaN  30.0
3  4.0  40.0
4  5.0  50.0

In [24]:
# Preencher valores ausentes usando outros métodos específicos

df['A'].fillna(df['A'].median(), inplace=True)
df['B'].fillna(df['B'].ffill(), inplace=True) # Preenchimento para a frente (forward fill)

df

     A     B
0  1.0  10.0
1  2.0  10.0
2  3.0  30.0
3  4.0  40.0
4  5.0  50.0

In [ ]:
# Dados duplicados
data7 = {'A': [1, 2, 3, 4, 2, 6, 8, 9, 2, 5, 2],
         'B': [10, 20, 30, 10, 50, 60]}

df = pd.DataFrame(data7)
df

In [28]:
# Mostra apenas quais colunas estão duplicadas
duplicadas = df[df.duplicated()]
duplicadas

# 
valoresDuplicadas = df['A'][df['A'].duplicated()].value_counts()
valoresDuplicadas

A
2    1
Name: count, dtype: int64

In [31]:
# Dados duplicados
data8 = {'A': [1, 2, 3, 4, 2, 6, 8, 9, 2, 5, 2],
         'B': [10, 20, 30, 10, 50, 60, 70, 67, 34, 56, 89]}

df = pd.DataFrame(data8)
df

    A   B
0   1  10
1   2  20
2   3  30
3   4  10
4   2  50
5   6  60
6   8  70
7   9  67
8   2  34
9   5  56
10  2  89

In [32]:
# Mostra apenas quais colunas estão duplicadas
duplicadas1 = df[df.duplicated()]
duplicadas1

# 
valoresDuplicadas1 = df['A'][df['A'].duplicated()].value_counts()
valoresDuplicadas1

A
2    3
Name: count, dtype: int64

In [ ]:
# Remover valores duplicados

# Dados duplicados
data9 = {'A': [1, 2, 3, 4, 2, 6, 8, 9, 2, 5, 2],
         'B': [10, 20, 30, 10, 50, 60, 70, 67, 34, 56, 89]}

df = pd.DataFrame(data9)
df

In [35]:
# Remove todas as duplicadas mas remove por linha, se não houver ocorrência de duplicada nas colunas, ele não remove
# removeDuplicadas = df.drop_duplicates()
# removeDuplicadas

# Remoção por coluna

removeDuplicadasA = df.drop_duplicates(subset=['A'])
removeDuplicadasA

   A   B
0  1  10
1  2  20
2  3  30
3  4  10
5  6  60
6  8  70
7  9  67
9  5  56